** Wrangling of Datablocks

In [3]:
import pandas as pd

In [4]:
DBs = pd.read_csv('DBs.csv')

In [7]:
DBsVan = DBs[['DBUID','CMANAME','DBPOP','lat','lon']]
DBsVan.rename(columns = {'DBUID':'id'}, inplace = True)
DBsVanD = DBsVan[DBsVan['CMANAME'] == 'Vancouver']
DBsVanD.drop(columns='CMANAME')

C:\Users\Graha\miniconda3\lib\site-packages\pandas\core\frame.py:4295: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

                 id DBPOP      lat       lon
442430  59150004004    35  49.3739 -123.2738
442431  59150004005    50  49.3746 -123.2757
442432  59150004006    94  49.3738 -123.2763
442433  59150004011     0  49.3735 -123.2725
442434  59150004012     0  49.3725 -123.2729
...             ...   ...      ...       ...
457622  59154055002     0  49.0044 -122.4774
457623  59154055003     0  49.0036 -122.4762
457624  59154055004   386  49.0029 -122.4757
457625  59154055005     0  49.0062 -122.4772
457626  59154056001    85  49.0053 -122.4748

[15197 rows x 4 columns]

In [8]:
DBsVanD.to_csv('vancouver_db.csv')